---
kind: type
id: T:Autodesk.Revit.DB.ListType
source: html/7163554f-3446-22eb-afa4-5490d5df29c8.htm
---
# Autodesk.Revit.DB.ListType

An enumerated type indicating the style of list item
 for paragraphs that are part of ordered or unordered lists
 in FormattedText .

## Syntax (C#)
```csharp
public enum ListType
```